#+TITLE: Typing Design
* Basic Description
An Entry point for type checking

Type checking is a triple of tries: (type_definitions,
 type_assignments, type_variables)

Definitions are structured polytypes.
Assignments start untyped, and are gradually refined.
Variables connect variables in the assignments to definitions.

The Tries use nodes of TypeDefTrieNode,
TypeAssignmentTrieNode, and VarTypeTrieNode.

The values of the trie nodes are acab.core.values, subclassed as Types.
They are TypeDefinitions, and TypeInstantiations.


When a TypeChecker is called with (Definitions, Rules, Assertions),
it adds the definitions, add the assertions,
then adds each rule, treating each rule as a separate context.

Definitions are located by their path (eg: type.test )
which holds the TypeDefintion (which contains its structure and vars)
(eg: { type.test.name!$x :: string, type.test.age!$y :: int })

type_assignments is the main 'work' trie, holding all sentences.
When an assertion/declaration is added, it adds the node then updates
the node to connect any variables in the sentence with variables
in the type_variable trie.
(eg: a.thing.$x,  a.different.thing :: type.test)

Variables connect different locations of the assignment trie together
(eg: a.thing.$x, another.thing.$x will share the same var node: $x)


When validate is called:
equivalent pathed nodes are merged,
then known types are applied everywhere they can be
the linked type definition then DFS's
ensure it matches the definition.
and any newly typed nodes are then ready to be used in the next iteration



If validate succeeds, it returns True. If it Fails, it raises an Exception
* Sequence Diagrams
#+NAME: Initialisation
#+begin_src plantuml :results value verbatim :preview t
acab -> typing : setup
typing -> assignments : init trie
typing -> definitions : init trie
typing -> variables : init dict
acab -> typing : sentences to typecheck
typing -> definitions : insert sentences
typing -> assignments : insert sentences
#+end_src

#+RESULTS: Initialisation
#+begin_example
     ┌────┐                 ┌──────┐          ┌───────────┐          ┌───────────┐          ┌─────────┐
     │acab│                 │typing│          │assignments│          │definitions│          │variables│
     └─┬──┘                 └──┬───┘          └─────┬─────┘          └─────┬─────┘          └────┬────┘
       │         setup         │                    │                      │                     │
       │ ──────────────────────>                    │                      │                     │
       │                       │                    │                      │                     │
       │                       │     init trie      │                      │                     │
       │                       │ ──────────────────>│                      │                     │
       │                       │                    │                      │                     │
       │                       │                 init trie                 │                     │
       │                       │ ─────────────────────────────────────────>│                     │
       │                       │                    │                      │                     │
       │                       │                    │       init dict      │                     │
       │                       │ ───────────────────────────────────────────────────────────────>│
       │                       │                    │                      │                     │
       │ sentences to typecheck│                    │                      │                     │
       │ ──────────────────────>                    │                      │                     │
       │                       │                    │                      │                     │
       │                       │             insert sentences              │                     │
       │                       │ ─────────────────────────────────────────>│                     │
       │                       │                    │                      │                     │
       │                       │  insert sentences  │                      │                     │
       │                       │ ──────────────────>│                      │                     │
     ┌─┴──┐                 ┌──┴───┐          ┌─────┴─────┐          ┌─────┴─────┐          ┌────┴────┐
     │acab│                 │typing│          │assignments│          │definitions│          │variables│
     └────┘                 └──────┘          └───────────┘          └───────────┘          └─────────┘
#+end_example

#+NAME: Checking
#+begin_src plantuml :results value verbatim :preview t
[-> typing : start
assignments -> typing : Get Known Type
typing -> variables : init new variables
typing -> definitions : get definition
definitions ->] : error if missing
definitions -> typing : type prototype
typing -> typing : check known type and use against prototype
typing -> variables : assign variables that are discovered
typing ->] : error if conflict
typing -> assignments : assign discovered types
typing -> variables : clear variables
#+end_src

#+RESULTS: Checking
#+begin_example
     ┌──────┐                                     ┌───────────┐          ┌─────────┐          ┌───────────┐
     │typing│                                     │assignments│          │variables│          │definitions│
     └──┬───┘                                     └─────┬─────┘          └────┬────┘          └─────┬─────┘
  start │                                               │                     │                     │
 ───────>                                               │                     │                     │
        │                                               │                     │                     │
        │                 Get Known Type                │                     │                     │
        │ <──────────────────────────────────────────────                     │                     │
        │                                               │                     │                     │
        │                          init new variables   │                     │                     │
        │ ────────────────────────────────────────────────────────────────────>                     │
        │                                               │                     │                     │
        │                                       get definition                │                     │
        │ ──────────────────────────────────────────────────────────────────────────────────────────>
        │                                               │                     │                     │
        │                                               │                     │                     │ error if missing
        │                                               │                     │                     │ ────────────────>
        │                                               │                     │                     │
        │                                       type prototype                │                     │
        │ <──────────────────────────────────────────────────────────────────────────────────────────
        │                                               │                     │                     │
        │────┐                                                                │                     │
        │    │ check known type and use against prototype                     │                     │
        │<───┘                                                                │                     │
        │                                               │                     │                     │
        │                 assign variables that are discovered                │                     │
        │ ────────────────────────────────────────────────────────────────────>                     │
        │                                               │                     │                     │
        │                                              error if conflict      │                     │
        │ ────────────────────────────────────────────────────────────────────────────────────────────────────────────>
        │                                               │                     │                     │
        │            assign discovered types            │                     │                     │
        │ ──────────────────────────────────────────────>                     │                     │
        │                                               │                     │                     │
        │                           clear variables     │                     │                     │
        │ ────────────────────────────────────────────────────────────────────>                     │
     ┌──┴───┐                                     ┌─────┴─────┐          ┌────┴────┐          ┌─────┴─────┐
     │typing│                                     │assignments│          │variables│          │definitions│
     └──────┘                                     └───────────┘          └─────────┘          └───────────┘
#+end_example
